//
//  Word List.swift
//  SMCroco
//
//  Created by Лариса Терегулова on 20.04.2023.
//

import Foundation

struct WordList {
    
    static let animal: [String] = ["Обезьяна", "Носорог", "Капибара", "Петух", "Жираф", "Скунс", "Крокодил", "Свинья", "Страус", "Енот"]
    
    static let eat: [String] = ["Пицца", "Суп", "Холодец", "Шаурма", "Пюре с гуляшом", "Роллы", "Торт Наполеон", "Плов", "Салат", "Селедка под шубой"]
    
    static let hobby: [String] = ["Дайвинг", "Коллекционирование", "Пчеловодство", "Аквариумистика", "Рыбалка", "Рисование", "Флористика", "Пение", "Скалолазание", "Шоппинг"]
    
    static let person: [String] = ["Сократ", "Сталин", "Гитлер", "Морзе", "Наполеон", "Илон Маск", "Путин", "Хеопс", "Брежнев", "Чарли Чаплин"]
    
    static let categories: [Array] = [animal, eat, hobby, person]
}
